import 'package:reserv_plus/features/faq/domain/entities/faq_item.dart';

class FaqData {
  static List<FaqItem> getAllFaqItems() {
    return const [
      FaqItem(
        id: '1',
        question: 'Хто опрацьовує мою заявку про виправлення даних?',
        answer: 'Заявку опрацьовує оператор у ТЦК.',
      ),
      FaqItem(
        id: '2',
        question:
            'Чому я не можу подати нову заявку, якщо попередню ще не опрацьовано?',
        answer:
            'Ми обмежуємо кількість заявок, щоб не перевантажувати операторів і дозволити їм обробляти звернення швидше.',
      ),
      FaqItem(
        id: '3',
        question:
            'Чому я можу надсилати заявки на виправлення даних лише раз на 48 годин?',
        answer:
            'Щоб заявки не дублювалися й оператори встигали якісно опрацьовувати їх.',
      ),
      FaqItem(
        id: '4',
        question: 'Чому немає доступних категорій для виправлення даних?',
        answer:
            'Категорії виправлення даних відображаються залежно від вашого статусу та наявних даних у реєстрі. Якщо ви знайшли помилку в даних, але відсутня відповідна категорія, зверніться до служби підтримки або у ТЦК.',
      ),
      FaqItem(
        id: '5',
        question: 'Тепер я маю постійно уточнювати дані?',
        answer:
            'Якщо ваші дані не змінилися – повторно уточнювати дані не потрібно. Це необхідно робити, коли у вас з\'явилася, наприклад, нова адреса чи номер телефону, щоб із вами могли оперативно зв\'язатися у разі потреби.',
      ),
      FaqItem(
        id: '6',
        question:
            'Чи будуть відправляти повістки за допомогою застосунку Резерв+?',
        answer:
            'Згідно з законодавством поняття «електронні повістки» не існує, тож в застосунку Резерв+ немає такого функціоналу.',
      ),
      FaqItem(
        id: '7',
        question: 'Що таке реєстр Оберіг?',
        answer:
            'Оберіг - це електронний реєстр, який збирає, зберігає та обробляє дані призовників, військовозобов\'язаних та резервістів для військового обліку.\n\nВін покликаний запобігти помилкам внаслідок людського фактору і заощадити ресурси держави та людини завдяки цифровізації.',
      ),
      FaqItem(
        id: '8',
        question: 'Звідки в реєстрі з\'явилась інформація про мене?',
        answer:
            'Дані для реєстру Оберіг вносяться працівниками ТЦК та СП з паперових карток обліку військовозобов\'язаних, призовників та резервістів.\n\nТакож дані потрапляють до реєстру з баз Центральної виборчої комісії, Державної податкової служби, Державної міграційної служби, Міністерства освіти і науки, Державної судової адміністрації, Пенсійного фонду, Міністерства соціальної політики, Державної прикордонної служб та інших відомств.',
      ),
      FaqItem(
        id: '9',
        question: 'Як видалити мої дані з застосунку?',
        answer:
            'Ваші дані не зберігаються на серверах мобільного застосунку, а відображаються з реєстру Оберіг. Також вони будуть зберігатись на вашому смартфоні в зашифрованому вигляді. Доступ до них ви зможете отримати лише після авторизації через BankID.',
      ),
      FaqItem(
        id: '10',
        question: 'Чи можна не оновлювати свою контактну інформацію?',
        answer:
            'Якщо ви є громадянином України і перебуваєте на військовому обліку, необхідно уточнити адресу проживання, номер телефону, адресу електронної пошти згідно з законодавством України.\n\nЦе потрібно зробити протягом 60 днів з 18 травня 2024 року.',
      ),
      FaqItem(
        id: '11',
        question: 'Як часто потрібно оновлювати мою контактну інформацію?',
        answer:
            'У разі зміни персональних даних – протягом 7 днів від дня зміни.',
      ),
      FaqItem(
        id: '12',
        question: 'Чому я бачу один тип заявки на виправлення даних?',
        answer:
            'Типи заявок доступні залежно від вашого статусу в системі. Наприклад, заявка «Я військовий, але досі на обліку» доступна лише для тих, хто ще перебуває на обліку. А заявка «Дані не знайдено» з\'являється, якщо система не може знайти ваші дані.',
      ),
      FaqItem(
        id: '13',
        question: 'Які персональні та службові дані можна переглядати?',
        answer:
            'У застосунку ви можете переглядати свої персональні дані, статус обліку та військово-обліковий документ.',
      ),
      FaqItem(
        id: '14',
        question: 'Як відбувається процес оновлення персональних даних?',
        answer:
            'Оновлення даних в реєстрі Оберіг відбувається безпосередньо після першого входу в застосунок Резерв+.\n\nПісля авторизації через BankID ваші персональні дані будуть автоматично підвантажені. А після підтвердження чи редагування їх автоматично передадуть до реєстру Оберіг.',
      ),
      FaqItem(
        id: '15',
        question:
            'Чому я можу уточнювати контактні дані тільки раз на тиждень?',
        answer:
            'Щоб уникнути плутанини в оновленнях і переконатися, що всі зміни були успішно збережені в реєстрі.',
      ),
      FaqItem(
        id: '16',
        question: 'Хто має доступ до моєї інформації?',
        answer:
            'Доступ до реєстру Оберіг мають Міністерство оборони України, Генеральний штаб ЗСУ, Служба безпеки України та Служба зовнішньої розвідки, а також ТЦК та СП як органи ведення реєстру.\n\nЗмінювати облікові дані в реєстрі мають право лише уповноважені працівники районних ТЦК та СП.\n\nКожна така зміна підписується особистим електронним ключем оператора.',
      ),
      FaqItem(
        id: '17',
        question: 'Наскільки безпечним є використання застосунку?',
        answer:
            'Застосунок Резерв+ успішно пройшов всі необхідні перевірки безпеки, підтвердивши високий рівень захисту даних, і отримав атестат відповідності комплексної системи захисту інформації (КСЗІ).\n\nЦе свідчить про те, що ми дбаємо про вашу безпеку та конфіденційність. Ви можете бути впевнені, що ваша інформація надійно захищена.',
      ),
      FaqItem(
        id: '18',
        question: 'Як забезпечується захист моїх персональних даних?',
        answer:
            'Застосунок Резерв+ побудований так, що на серверній частині взагалі не здійснюється зберігання персональних даних користувачів.\n\nПри цьому інформація передається виключно у зашифрованому вигляді.\n\nСерверна частина системи розгорнута в хмарній інфраструктурі, яка має необхідні сертифікати безпеки, у тому числі – атестат відповідності комплексній системі захисту інформації (КСЗІ).',
      ),
      FaqItem(
        id: '19',
        question: 'Що означає статус «Виключений з обліку»?',
        answer:
            'Цей статус присвоюється військовослужбовцям, непридатним до військової служби за висновком ВЛК, а також тим, хто досягнув 60 років. На цих громадян не поширюються правила щодо військовозобов\'язаних.',
      ),
      FaqItem(
        id: '20',
        question:
            'Чи можливо повторно зробити запит на отримання своїх персональних даних в застосунку?',
        answer:
            'Так. Ви можете повторно завантажити свої дані безпосередньо з екрану облікової картки за допомогою пункта меню «Оновити дані з реєстру», яке відкривається по кнопці [+]',
      ),
      FaqItem(
        id: '21',
        question:
            'Чи можна вважати застосунок Резерв+ електронним кабінетом військовозобов\'язаного?',
        answer:
            'Так, електронний кабінет військовозобов\'язаного реалізований у форматі застосунку Резерв+.\n\nПостанова, яка врегульовує функціонування застосунку, прийнята 10 травня 2024 року. Наразі інформація постанови має обмеження доступу, тому текст не можна проглянути публічно.\n\nТакож функціонування застосунку регулюється наказом Міністра від 29 квітня 2024 року про створення інформаційно-комунікаційної системи для доступу до електронного кабінету військовозобов\'язаного',
      ),
      FaqItem(
        id: '22',
        question: 'Що означає статус «Уточнюється» чи «Потребує уточнення»?',
        answer:
            'Цей статус означає, що громадянин є в реєстрі Оберіг, проте не закріплений за жодним ТЦК.\n\nРадимо звернутись до ТЦК за місцем реєстрації та надати їм необхідні документи.\n\nЗручно та легко записатись в електронну чергу до ТЦК можна, клікнувши на банер на головній сторінці сайту Міністерства оборони.\n\nТЦК оновить дані в електронному реєстрі Оберіг, тож оновлений статус буде автоматично завантажений до застосунку.',
      ),
      FaqItem(
        id: '23',
        question:
            'Що робити, якщо при спробі уточнити дані я бачу технічну помилку?',
        answer:
            'У разі технічної помилки зверніться до служби підтримки через застосунок або телефонуйте на гарячу лінію.',
      ),
      FaqItem(
        id: '24',
        question: 'Навіщо потрібен застосунок Резерв+?',
        answer:
            'Резерв+ — це мобільний застосунок від Міністерства оборони України для військовозобов\'язаних, у якому можна зручно та швидко оновити персональні дані без походу в ТЦК.\n\nТакож у застосунку ви можете отримати електронний військово-обліковий документ, який матиме таку ж юридичну силу, як паперовий.',
      ),
      FaqItem(
        id: '25',
        question:
            'Я — військовослужбовець, але бачу статус «На обліку», що робити?',
        answer:
            'Цей статус означає, що ТЦК та СП не оцифрував дані щодо вас. Коректний статус військовослужбовців наразі — це «Виключено».\n\nРадимо скористатися розділом «Виправити дані онлайн» в меню і відправити запит, натиснувши «Я військовий, але досі на обліку».',
      ),
      FaqItem(
        id: '26',
        question:
            'Що робити у разі отримання сповіщення «Дані в реєстрі Оберіг не знайдено»?',
        answer:
            'Це повідомлення означає, що дані щодо вас не оцифровані або ж внесені некоректно.\n\nРадимо скористатися розділом «Виправити дані онлайн» в меню і відправити запит, натиснувши «Дані не знайдено».',
      ),
      FaqItem(
        id: '27',
        question: 'Що означає статус «Виключено»?',
        answer:
            'Цей статус присвоюється військовослужбовцям, непридатним до військової служби за висновком ВЛК, а також тим, хто досягнув граничного віку перебування на військовому обліку.\n\nНа цих громадян не поширюються правила щодо військовозобов\'язаних.\n\nДля військовослужбовців Міноборони готує інший застосунок Армія+.',
      ),
      FaqItem(
        id: '28',
        question:
            'Якими нормативно-правовими актами регулюється функціонування Резерв+?',
        answer:
            'Перш за все це Закон України «Про Єдиний державний реєстр призовників, військовозобов\'язаних та резервістів», який визначає поняття електронного кабінету призовника, військовозобов\'язаного і резервіста. Кабінет реалізовано у форматі застосунку Резерв+.\n\nПостанова, яка врегульовує функціонування застосунку, прийнята 10 травня 2024 року. Наразі інформація постанови має обмеження доступу, тому текст не можна переглянути публічно.\n\nТакож функціонування застосунку регулюється наказом Міністра від 29 квітня 2024 року про створення інформаційно-комунікаційної системи для доступу до електронного кабінету призовника, військовозобов\'язаного і резервіста.\n\nПорядок формування та використання електронного військово-облікового документа визначається постановою Кабінету Міністрів України від 16.05.2024 № 559.',
      ),
      FaqItem(
        id: '29',
        question:
            'Чи є електронний військово-обліковий документ у Резерв+ офіційним?',
        answer:
            'Так, електронний військово-обліковий документ у застосунку Резерв+ є офіційним та має юридичну силу.',
      ),
      FaqItem(
        id: '30',
        question: 'Направлення на ВЛК',
        answer:
            'Направлення на ВЛК (військово-лікарську комісію) можна отримати через застосунок або у ТЦК.',
      ),
      FaqItem(
        id: '31',
        question: 'Дані про інвалідність',
        answer:
            'Дані про інвалідність відображаються у вашому військово-обліковому документі та можуть бути оновлені через ТЦК.',
      ),
      FaqItem(
        id: '32',
        question: 'Відстрочка',
        answer:
            'Інформацію про відстрочку від військової служби можна переглянути у застосунку або уточнити у ТЦК.',
      ),
      FaqItem(
        id: '33',
        question: 'Вакансії',
        answer:
            'У застосунку Резерв+ доступний розділ з вакансіями для військовозобов\'язаних.',
      ),
      FaqItem(
        id: '34',
        question: 'Штрафи онлайн',
        answer:
            'Інформацію про штрафи можна переглянути у відповідному розділі застосунку.',
      ),
    ];
  }
}
